Repository: guix-mirror/guix
Catalog: po/guix/*.po
Languages: hu, sr

source: cannot access `~a': ~a~%
hu: nem sikerült elérni: „~a”: ~a~%
sr: не могу да приступим „~a“: ~a~%

source: looking for the latest release of GNU ~a...
hu: a GNU ~a legutóbbi kiadásának keresése…
sr: тражим последње издање Гнуа ~a...

source: ~a: note: using ~a but ~a is available upstream~%
hu: ~a: megjegyzés: ~a használata, de ~a elérhető a tárolóban~%
sr: ~a: напомена: користим ~a али ~a је доступно узводно~%

source: ambiguous package specification `~a'~%
hu: nem egyértelmű csomag specifikáció: „~a”~%
sr: нејасна одредница пакета „~a“~%

source: choosing ~a from ~a~%
hu: ~a választása innen: ~a~%
sr: бирам ~a из ~a~%

source: ~A: package not found for version ~a~%
hu: ~A: nem található csomag ehhez a verzióhoz: ~a~%
sr: ~A: нисам пронашао пакет за издање ~a~%

source: ~A: unknown package~%
hu: ~A: ismeretlen csomag~%
sr: ~A: непознат пакет~%

source: failed to create GC root `~a': ~a~%
hu: nem sikerült a GC gyökér létrehozása: „~a”: ~a~%
sr: нисам успео да направим ГЦ корен „~a“: ~a~%

source: -L, --load-path=DIR prepend DIR to the package module search path
hu: -L, --load-path=KVT KVT beszúrása a csomag modul keresési útvonalhoz

source: -K, --keep-failed keep build tree of failed builds
hu: -K, --keep-failed sikertelen összeállítások összeállítási fájának megtartása
sr: -K, --keep-failed задржава стабло изградње неуспелих изградњи

source: -n, --dry-run do not build the derivations
hu: -n, --dry-run ne állítsa össze a származékokat
sr: -n, --dry-run не изграђује изведенице

source: --fallback fall back to building when the substituter fails
hu: --fallback térjen vissza az összeállításra, ha a helyettesítő sikertelen
sr: --fallback враћа се на изградњу када заменик не успе

source: --no-substitutes build instead of resorting to pre-built substitutes
hu: --no-substitutes összeállítás az előre összeállított helyettesítők felhasználása helyett
sr: --no-substitutes изграђује уместо да поново ређа заменике предизградње

source: --no-build-hook do not attempt to offload builds via the build hook
hu: --no-build-hook ne próbáljon meg összeállításokat tehermentesíteni az összeállítási hurkon keresztül
sr: --no-build-hook не покушава да растерети изградњу путем предворја изградње

source: --max-silent-time=SECONDS mark the build as failed after SECONDS of silence
hu: --max-silent-time=MÁSODPERC az összeállítás sikertelennek jelölése MÁSODPERC hallgatás után
sr: --max-silent-time=СЕКУНДЕ означава изградњу неупелом након СЕКУНДЕ мировања

source: --timeout=SECONDS mark the build as failed after SECONDS of activity
hu: --timeout=MÁSODPERC az összeállítás sikertelennek jelölése MÁSODPERC aktivitás után
sr: --timeout=СЕКУНДЕ означава изградњу неуспелом након СЕКУНДЕ рада

source: --verbosity=LEVEL use the given verbosity LEVEL
hu: --verbosity=SZINT a megadott bőbeszédűségi SZINT használata
sr: --verbosity=НИВО користи дати НИВО опширности

source: -c, --cores=N allow the use of up to N CPU cores for the build
hu: -c, --cores=N legfeljebb N CPU-mag használatának engedélyezése az összeállításhoz
sr: -c, --cores=N омогућава коришћење до N језгра процесора за изградњу

source: ~a: not a number~%
hu: ~a: nem szám~%
sr: ~a: није број~%

source: Usage: guix build [OPTION]... PACKAGE-OR-DERIVATION... Build the given PACKAGE-OR-DERIVATION and return their output paths.
hu: Használat: guix build [KAPCSOLÓ]… CSOMAG-VAGY-SZÁRMAZTATOTT… A megadott CSOMAG-VAGY-SZÁRMAZTATOTT összeállítása, és a kimeneti elérési útjaik visszaadása.
sr: Употреба: guix build [ОПЦИЈА]... ПАКЕТ-ИЛИ-ИЗВЕДНИЦА... Изграђује дати ПАКЕТ-ИЛИ-ИЗВЕДНИЦУ и исписује њихове путање излаза.

source: -e, --expression=EXPR build the package or derivation EXPR evaluates to
hu: -e, --expression=KIF a csomag vagy a kiértékelt származtatott KIF összeállítása
sr: -e, --expression=ИЗРАЗ изграђује процене ИЗРАЗА пакета или изведенице на

source: -S, --source build the packages' source derivations
hu: -S, --source a csomagok forrásszármazékainak összeállítása
sr: -S, --source изграђује изведенице извора пакета

source: -s, --system=SYSTEM attempt to build for SYSTEM--e.g., "i686-linux"
hu: -s, --system=RENDSZER kísérlet a RENDSZERRE történő összeállításra, például „i686-linux”
sr: -s, --system=СИСТЕМ покушава да изгради за СИСТЕМ--e.g., „i686-linux“

source: --target=TRIPLET cross-build for TRIPLET--e.g., "armel-linux-gnu"
hu: --target=HÁRMAS kereszt összeállítás a HÁRMASRA, például „armel-linux-gnu”
sr: --target=ТРОЈКА унакрсно изграђује за ТРОЈКУ--e.g., „armel-linux-gnu“

source: --with-source=SOURCE use SOURCE when building the corresponding package
hu: --with-source=FORRÁS FORRÁS használata a megfelelő csomag összeállításakor
sr: --with-source=ИЗВОР користи ИЗВОР приликом изградње одговарајућег пакета

source: --no-grafts do not graft packages
hu: --no-grafts ne oltsa be a csomagokat

source: -d, --derivations return the derivation paths of the given packages
hu: -d, --derivations a megadott csomagok származék-útvonalának visszaadása
sr: -d, --derivations исписује путање изведенице датог пакета

source: -r, --root=FILE make FILE a symlink to the result, and register it as a garbage collector root
hu: -r, --root=FÁJL a FÁJL az eredmény egy szimbolikus linkje legyen, és regisztrálja gyökér szemétgyűjtőként
sr: -r, --root=ДАТОТЕКА чини ДАТОТЕКУ симболичком везом ка резултату, и бележи је као корен скупљача ђубра

source: --log-file return the log file names for the given derivations
hu: --log-file a megadott származékok naplófájl-neveinek visszaadása
sr: --log-file исписује називе датотеке дневника за дате изведенице

source: -h, --help display this help and exit
hu: -h, --help ezen súgó megjelenítése és kilépés
sr: -h, --help приказује ову помоћ и излази

source: -V, --version display version information and exit
hu: -V, --version verzióinformációk megjelenítése és kilépés
sr: -V, --version приказује податке о издању и излази

source: sources do not match any package:~{ ~a~}~%
hu: a források nem illeszkednek semmilyen csomagra:~{ ~a~}~%
sr: извори не одговарају ниједном пакету:~{ ~a~}~%

source: ~A: unrecognized option~%
hu: ~A: ismeretlen kapcsoló~%
sr: ~A: непозната опција~%

source: no build log for '~a'~%
hu: nincs összeállítási napló ehhez: „~a”~%
sr: нема дневника изградње за „~a“~%

source: Usage: guix download [OPTION] URL Download the file at URL, add it to the store, and print its store path and the hash of its contents. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
hu: Használat: guix download [KAPCSOLÓ] URL A fájl letöltése az URL-ről, hozzáadás a tárolóhoz, és a tárolója útvonalának és a tartalma hash-ének kiírása. Támogatott formátumok: „nix-base32” (alapértelmezett), „base32” és „base16” („hex” és „hexadecimal” is használható).
sr: Употреба: guix download [ОПЦИЈА] АДРЕСА Преузима датотеку са адресе, додаје је у складиште, и исписује њену путању складиштења и хеш њеног садржаја. Подржани записи: „nix-base32“ (основни), „base32“, и „base16“ („hex“ и „hexadecimal“ могу такође бити коришћени).

source: -f, --format=FMT write the hash in the given format
hu: -f, --format=FMT a hash kiírása a megadott formátumban
sr: -f, --format=ФМТ записује хеш у датом запису

source: unsupported hash format: ~a~%
hu: nem támogatott hash-formátum: ~a~%
sr: неподржани запис хеша: ~a~%

source: ~a: failed to parse URI~%
hu: ~a: az URI feldolgozása sikertelen~%
sr: ~a: нисам успео да обрадим путању~%

source: ~a: download failed~%
hu: ~a: letöltés sikertelen~%
sr: ~a: преузимање није успело~%

source: failed to build the empty profile~%
hu: az üres profil összeállítása sikertelen~%
sr: нисам успео да изградим празан профил~%

source: switching from generation ~a to ~a~%
hu: átváltás a(z) ~a generációról erre: ~a~%
sr: пребацујем се са генерације ~a на ~a~%

source: nothing to do: already at the empty profile~%
hu: nincs mit tenni: már az üres profilnál van~%
sr: ништа за урадити: већ сам у празном профилу~%

source: deleting ~a~%
hu: ~a törlése~%
sr: бришем ~a~%

source: package `~a' lacks output `~a'~%
hu: a(z) „~a” csomag hiányolja a kimenetet: „~a”~%
sr: пакету „~a“ недостаје излаз „~a“~%

source: ~a: package not found~%
hu: ~a: a csomag nem található~%
sr: ~a: нисам пронашао пакет~%

source: The following environment variable definitions may be needed:~%
hu: A következő környezeti változó meghatározások lehetnek szükségesek:~%
sr: Следеће одреднице променљиве окружења могу бити потребне:~%

source: Usage: guix package [OPTION]... PACKAGES... Install, remove, or upgrade PACKAGES in a single transaction.
hu: Használat: guix package [KAPCSOLÓ]… CSOMAGOK… CSOMAGOK telepítése, eltávolítása vagy frissítése egyetlen tranzakcióban.
sr: Употреба: guix package [ОПЦИЈА]... ПАКЕТИ... Инсталирајте, уклоните, или доградите ПАКЕТЕ у једном прелазу.

source: -i, --install=PACKAGE install PACKAGE
hu: -i, --install=CSOMAG CSOMAG telepítése
sr: -i, --install=ПАКЕТ инсталира ПАКЕТ

source: -e, --install-from-expression=EXP install the package EXP evaluates to
hu: -e, --install-from-expression=KIF a kiértékelt KIF csomag telepítése
sr: -e, --install-from-expression=ИЗР инсталира процене ИЗР пакета у

source: -r, --remove=PACKAGE remove PACKAGE
hu: -r, --remove=CSOMAG CSOMAG eltávolítása
sr: -r, --remove=ПАКЕТ уклања ПАКЕТ

source: -u, --upgrade[=REGEXP] upgrade all the installed packages matching REGEXP
hu: -u, --upgrade[=REGKIF] az összes REGKIF-re illeszkedő telepített csomag frissítése
sr: -u, --upgrade[=РЕГИЗР] дограђује све инсталиране пакете који одговарају РЕГИЗРАЗУ

source: --roll-back roll back to the previous generation
hu: --roll-back visszagörgetés az előző generációra
sr: --roll-back враћа се на претходну генерацију

source: --search-paths display needed environment variable definitions
hu: --search-paths a szükséges környezeti változó meghatározások megjelenítése
sr: --search-paths приказује потребне одреднице променљиве окружења

source: -l, --list-generations[=PATTERN] list generations matching PATTERN
hu: -l, --list-generations[=MINTA] a MINTÁRA illeszkedő generációk listázása
sr: -l, --list-generations[=ШАБЛОН] исписује генерације које одговарају ШАБЛОНУ

source: -d, --delete-generations[=PATTERN] delete generations matching PATTERN
hu: -d, --delete-generations[=MINTA] a MINTÁRA illeszkedő generációk törlése
sr: -d, --delete-generations[=ШАБЛОН] брише генерације које одговарају ШАБЛОНУ

source: -S, --switch-generation=PATTERN switch to a generation matching PATTERN
hu: -S, --switch-generation=MINTA átváltás a MINTÁRA illeszkedő generációra

source: -p, --profile=PROFILE use PROFILE instead of the user's default profile
hu: -p, --profile=PROFIL a PROFIL használata a felhasználó alapértelmezett profilja helyett
sr: -p, --profile=ПРОФИЛ користи ПРОФИЛ уместо корисничког подразумеваног

source: --bootstrap use the bootstrap Guile to build the profile
hu: --bootstrap a Guile rendszertöltő használata a profil összeállításához
sr: --bootstrap користи Гуиле почетног учитавања да изгради профил

source: --verbose produce verbose output
hu: --verbose bőbeszédű kimenet előállítása
sr: --verbose ствара опширан излаз

source: -s, --search=REGEXP search in synopsis and description using REGEXP
hu: -s, --search=REGKIF keresés az összegzésben és a leírásban REGKIF használatával
sr: -s, --search=РЕГИЗР тражи у скици и опису користећи РЕГИЗР

source: -I, --list-installed[=REGEXP] list installed packages matching REGEXP
hu: -I, --list-installed[=REGKIF] a REGKIF-re illeszkedő telepített csomagok listázása
sr: -I, --list-installed[=РЕГИЗР] исписује инсталиране пакете који одговарају РЕГИЗРАЗУ

source: -A, --list-available[=REGEXP] list available packages matching REGEXP
hu: -A, --list-available[=REGKIF] a REGKIF-re illeszkedő elérhető csomagok listázása
sr: -A, --list-available[=РЕГИЗР] исписује доступне пакете који одговарају РЕГИЗРАЗУ

source: --show=PACKAGE show details about PACKAGE
hu: --show=CSOMAG a CSOMAG részleteinek megjelenítése

source: ~A: extraneous argument~%
hu: ~A: nem odatartozó argumentum~%
sr: ~A: страни аргумент~%

source: Try "info '(guix) Invoking guix package'" for more information.~%
hu: További információkért próbálja az „info '(guix) Invoking guix package'” parancsot.~%
sr: Покушајте „info '(guix) Invoking guix package'“ за више података.~%

source: error: while creating directory `~a': ~a~%
hu: hiba: a(z) „~a” könyvtár létrehozása közben: ~a~%
sr: грешка: приликом стварања директоријума „~a“: ~a~%

source: Please create the `~a' directory, with you as the owner.~%
hu: Hozza létre a(z) „~a” könyvtárat az ön nevében, tulajdonosként.~%
sr: Направите директоријум „~a“, у вашем власништву.~%

source: error: directory `~a' is not owned by you~%
hu: hiba: a(z) „~a” könyvtárnak nem ön a tulajdonosa~%
sr: грешка: директоријум „~a“ није у вашем власништву~%

source: Please change the owner of `~a' to user ~s.~%
hu: Változtassa meg a(z) „~a” tulajdonosát erre a felhasználóra: ~s.~%
sr: Поставите као власника ~s над „~a“.~%

source: cannot switch to generation '~a'~%
hu: nem sikerült átváltani erre a generációra: „~a”~%

source: invalid syntax: ~a~%
hu: érvénytelen szintaxis: ~a~%
sr: неисправна синтакса: ~a~%

source: nothing to be done~%
hu: nincs mit tenni~%
sr: ништа неће бити урађено~%

source: ~a package in profile~%
hu: ~a csomag a profilban~%
sr: ~a пакет у профилу~%

source: Generation ~a ~a
hu: ~a generáció ~a
sr: Генерација ~a ~a

source: ~a (current)~%
hu: ~a (jelenlegi)~%
sr: ~a (текуће)~%

source: Usage: guix gc [OPTION]... PATHS... Invoke the garbage collector.
hu: Használat: guix gc [KAPCSOLÓ]… ÚTVONALAK… A szemétgyűjtő meghívása.
sr: Употреба: guix gc [ОПЦИЈА]... ПУТАЊЕ... Позовите скупљача ђубра.

source: -C, --collect-garbage[=MIN] collect at least MIN bytes of garbage
hu: -C, --collect-garbage[=MIN] legalább MIN bájt szemét összegyűjtése
sr: -C, --collect-garbage[=НАЈМ] скупља барем НАЈМ бајтова ђубра

source: -d, --delete attempt to delete PATHS
hu: -d, --delete ÚTVONALAK törlésének kísérlete
sr: -d, --delete покушава да обрише ПУТАЊЕ

source: --list-dead list dead paths
hu: --list-dead halott útvonalak listázása
sr: --list-dead исписује мртве путање

source: --list-live list live paths
hu: --list-live élő útvonalak listázása
sr: --list-dead исписује живе путање

source: --references list the references of PATHS
hu: --references az ÚTVONALAK hivatkozásainak listázása
sr: --references исписује упуте ПУТАЊА

source: -R, --requisites list the requisites of PATHS
hu: -R, --requisites az ÚTVONALAK követelményeinek listázása
sr: --references исписује захтеве ПУТАЊА

source: --referrers list the referrers of PATHS
hu: --referrers az ÚTVONALAK ajánlóinak listázása
sr: --referrers исписује убрајаче ПУТАЊА

source: invalid amount of storage: ~a~%
hu: érvénytelen tárolómennyiség: ~a~%
sr: неисправан износ складишта: ~a~%

source: Usage: guix hash [OPTION] FILE Return the cryptographic hash of FILE. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
hu: Használat: guix hash [KAPCSOLÓ] FÁJL A FÁJL kriptográfiai hash-ének visszaadása. Támogatott formátumok: „nix-base32” (alapértelmezett), „base32” és „base16” („hex” és „hexadecimal” is használható).
sr: Употреба: guix hash [ОПЦИЈА] ДАТОТЕКА Исписује шифрерски хеш ДАТОТЕКЕ. Подржани записи: „nix-base32“ (задато), „base32“, и „base16“ („hex“ и „hexadecimal“ могу такође бити коришћени).

source: -r, --recursive compute the hash on FILE recursively
hu: -r, --recursive a FILE hash-ének rekurzív számítása
sr: -r, --recursive рачуна хеш дубински на ДАТОТЕЦИ

source: unrecognized option: ~a~%
hu: ismeretlen kapcsoló: ~a~%
sr: непозната опција: ~a~%

source: wrong number of arguments~%
hu: nem megfelelő számú argumentum~%
sr: погрешан број аргумената~%

source: Usage: guix pull [OPTION]... Download and deploy the latest version of Guix.
hu: Használat: guix pull [KAPCSOLÓ]… A Guix legújabb verziójának letöltése és telepítése.
sr: Употреба: guix pull [ОПЦИЈА]... Преузима и развија најновије издање Гуикса.

source: --url=URL download the Guix tarball from URL
hu: --url=URL a Guix tarball letöltése az URL-ről
sr: --url=АДРЕСА преузима тарбал Гуикса са АДРЕСЕ

source: --bootstrap use the bootstrap Guile to build the new Guix
hu: --bootstrap a Guile rendszertöltő használata az új Guix összeállításához
sr: --bootstrap користи Гуиле почетног учитавања да изгради нови Гуикс

source: tarball did not produce a single source directory
hu: a tarball nem hozott létre egyedüli forráskönyvtárat

source: unpacking '~a'...~%
hu: kibontás: „~a”...~%

source: failed to unpack source code
hu: nem sikerült a forráskód kibontása

source: updated ~a successfully deployed under `~a'~%
hu: a(z) ~a frissítése sikeresen telepítve ez alá: „~a”~%
sr: ажурирани ~a је успешно развијен под „~a“~%

source: failed to update Guix, check the build log~%
hu: a Guix frissítése sikertelen, nézze meg az összeállítási naplót~%
sr: нисам успео да ажурирам Гуикс, проверите дневник изградње~%

source: Guix already up to date
hu: A Guix már naprakész
sr: Гуикс је већ ажуриран

source: ~A: unexpected argument~%
hu: ~A: nem várt argumentum~%
sr: ~A: неочекивани аргумент~%

source: failed to download up-to-date source, exiting
hu: a legfrissebb forrás letöltése sikertelen, kilépés
sr: нисам успео да преузмем најсвежији извор, излазим

source: authentication and authorization of substitutes disabled!~%
hu: a helyettesítők hitelesítése és felhatalmazása letiltva!~%
sr: потврђивање идентитета и овлашћивање замена је искључено!~%

source: download from '~a' failed: ~a, ~s~%
hu: a letöltés sikertelen innen: „~a”: ~a, ~s~%
sr: преузимање са „~a“ није успело: ~a, ~s~%

source: while fetching ~a: server is unresponsive~%
hu: ~a lekérése közben: a kiszolgáló nem válaszol~%
sr: приликом довлачења ~a: сервер не одговара~%

source: try `--no-substitutes' if the problem persists~%
hu: próbálja a „--no-substitutes” kapcsolót, ha a probléma továbbra is fennáll~%
sr: покушајте „--no-substitutes“ ако се неприлике наставе~%

source: signature version must be a number: ~a~%
hu: az aláírás verziójának számnak kell lennie: ~a~%
sr: издање потписа мора бити број: ~a~%

source: unsupported signature version: ~a~%
hu: nem támogatott aláírás verzió: ~a~%
sr: неподржано издање потписа: ~a~%

source: signature is not a valid s-expression: ~s~%
hu: az aláírás nem érvényes s-kifejezés: ~s~%
sr: потпис није исправан с-израз: ~s~%

source: invalid format of the signature field: ~a~%
hu: az aláírásmező formátuma érvénytelen: ~a~%
sr: неисправан запис поља потписа: ~a~%

source: invalid signature for '~a'~%
hu: érvénytelen aláírás ehhez: „~a”~%
sr: неисправан потпис за „~a“~%

source: hash mismatch for '~a'~%
hu: hash eltérés ennél: „~a”~%
sr: хеш не одговара за „~a“~%

source: '~a' is signed with an unauthorized key~%
hu: a(z) „~a” egy jogosulatlan kulccsal van aláírva~%
sr: „~a“ је потписано неовлашћеним кључем~%

source: signature on '~a' is corrupt~%
hu: a(z) „~a” aláírása sérült~%
sr: потпис на „~a“ је оштећен~%

source: substitute at '~a' lacks a signature~%
hu: a helyettesítő ennél: „~a” hiányol egy aláírást~%
sr: замени на „~a“ недостаје потпис~%

source: Downloading, please wait...~%
hu: Letöltés, kérem várjon…~%
sr: Преузима, молим сачекајте...~%

source: (Please consider upgrading Guile to get proper progress report.)~%
hu: (Fontolja meg a Guile frissítését a megfelelő állapotjelentés beszerzéséhez.)~%
sr: (Размотрите надоградњу Гуила да добијете извештај о његовом напредовању.)~%

source: host name lookup error: ~a~%
hu: gépnév keresési hiba: ~a~%
sr: грешка тражења назива домаћина: ~a~%

source: Usage: guix substitute-binary [OPTION]... Internal tool to substitute a pre-built binary to a local build.
hu: Használat: guix substitute-binary [KAPCSOLÓ]… Belső eszköz egy előre összeállított binárisnak egy helyi összeállítással való helyettesítéséhez.
sr: Употреба: guix substitute-binary [ОПЦИЈА]... Унутрашњи алат за замену пре-изграђеног извршног у месну изградњу.

source: --query report on the availability of substitutes for the store file names passed on the standard input
hu: --query a helyettesítők elérhetőségének jelentése a szabványos bemeneten átadott tároló fájlnevekhez
sr: --query извештава о доступности заменика за називе датотека складишта прослеђених на стандардном улазу

source: --substitute STORE-FILE DESTINATION download STORE-FILE and store it as a Nar in file DESTINATION
hu: --substitute TÁROLÓ-FÁJL CÉL TÁROLÓ-FÁJL letöltése és eltárolása Nar formátumban a CÉL fájlban
sr: --substitute ОДРЕДИШТЕ СКЛАДИШНЕ-ДАТОТЕКЕ преузима СКЛАДИШНУ-ДАТОТЕКУ и смешта је као Нар удатотеци ОДРЕДИШТЕ

source: ACL for archive imports seems to be uninitialized, substitutes may be unavailable
hu: Az ACL előkészítetlennek tűnik az archívum importokhoz, a helyettesítők elérhetetlenek lehetnek
sr: АЦЛ за увоз архиве изгледа да је неупотребљив, замене могу бити недоступне

source: these substitute URLs will not be used:~{ ~a~}~%
hu: ezek a helyettesítő URL-ek nem lesznek használva:~{ ~a~}~%

source: failed to look up host '~a' (~a), substituter disabled~%
hu: a(z) „~a” (~a) gép keresése sikertelen, a helyettesítő letiltva~%
sr: нисам успео да потражим домаћина „~a“ (~a), замењивач је искључен~%

source: ~a: unrecognized options~%
hu: ~a: ismeretlen kapcsolók~%
sr: ~a: непозната опција~%

source: cannot find public key for secret key '~a'~%
hu: nem található nyilvános kulcs a(z) „~a” titkos kulcshoz~%
sr: не могу да нађем јавни кључ за тајни кључ „~a“~%

source: error: invalid signature: ~a~%
hu: hiba: érvénytelen aláírás: ~a~%
sr: грешка: неисправан потпис: ~a~%

source: error: unauthorized public key: ~a~%
hu: hiba: jogosulatlan nyilvános kulcs: ~a~%
sr: грешка: неовлашћени јавни кључ: ~a~%

source: error: corrupt signature data: ~a~%
hu: hiba: sérült aláírás adatok: ~a~%
sr: грешка: оштећени подаци потписа: ~a~%

source: Usage: guix authenticate OPTION... Sign or verify the signature on the given file. This tool is meant to be used internally by 'guix-daemon'.
hu: Használat: guix authenticate KAPCSOLÓ… Aláírás vagy a megadott fájl aláírásának ellenőrzése. Az eszköz célja, hogy a „guix-daemon” belsőleg felhasználja.
sr: Употреба: guix authenticate ОПЦИЈА... Потпишите или проверите потпис на датој датотеци. Овај алат је замишљен за унутрашњу употребу гуих-демоном.

source: wrong arguments
hu: hibás argumentumok
sr: погрешни аргуменати

source: failed to open operating system file '~a': ~a~%
hu: a(z) „~a” operációs rendszer fájl megnyitása sikertelen: ~a~%
sr: нисам успео да отворим датотеку оперативног система „~a“: ~a~%

source: failed to load operating system file '~a': ~s~%
hu: a(z) „~a” operációs rendszer fájl betöltése sikertelen: ~s~%
sr: нисам успео да учитам датотеку оперативног система „~a“: ~s~%

source: failed to register '~a' under '~a'~%
hu: a(z) „~a” regisztrálása sikertelen ez alá: „~a”~%
sr: нисам успео да убележим „~a“ под „~a“~%

source: initializing the current root file system~%
hu: a jelenlegi gyökér fájlrendszer előkészítése~%
sr: покрећем текући корени систем датотека~%

source: failed to install GRUB on device '~a'~%
hu: a GRUB telepítése sikertelen a(z) „~a” eszközre~%
sr: нисам успео да инсталирам ГРУБ на уређају „~a“~%

source: activating system...~%
hu: a rendszer aktiválása…~%
sr: покрећем систем...~%

source: unrecognized boot parameters for '~a'~%
hu: azonosítatlan indítási paraméterek ehhez: „~a”~%
sr: непознати подизни параметри за „~a“~%

source: initializing operating system under '~a'...~%
hu: az operációs rendszer előkészítése „~a” alá…~%
sr: покрећем оперативни систем под „~a“...~%
