Repository: guix-mirror/guix
Catalog: po/guix/*.po
Languages: hu, sr

source: Usage: guix system [OPTION] ACTION FILE Build the operating system declared in FILE according to ACTION.
hu: Használat: guix system [KAPCSOLÓ] MŰVELET FÁJL A FÁJLBAN meghatározott operációs rendszer összeállítása a MŰVELET szerint.
sr: Употреба: guix system [ОПЦИЈА] РАДЊА ДАТОТЕКА Изграђује оперативни систем објављен у ДАТОТЕЦИ у складу са РАДЊОМ.

source: The valid values for ACTION are:
hu: A MŰVELET érvényes értékei a következők:
sr: Исправне вредности за РАДЊУ су:

source: - 'reconfigure', switch to a new operating system configuration
hu: - „reconfigure”, átváltás egy új operációs rendszer beállításra
sr: — „reconfigure“, пребацује на подешавање новог оперативног система

source: - 'build', build the operating system without installing anything
hu: - „build”, az operációs rendszer összeállítása bármi telepítése nélkül
sr: — „build“, изграђује оперативни систем а не инсталира ништа

source: - 'vm', build a virtual machine image that shares the host's store
hu: - „vm”, egy virtuális gép lemezkép összeállítása, amely megosztja a gazda tárolóját
sr: — „vm“, изграђује слику виртуелне машине која дели складиште домаћина

source: - 'vm-image', build a freestanding virtual machine image
hu: - „vm-image”, egy szabadon álló virtuális gép lemezkép összeállítása
sr: — „vm-image“, изграђује самостојећу слику виртуелне машине

source: - 'disk-image', build a disk image, suitable for a USB stick
hu: - „disk-image”, egy USB-meghajtóhoz megfelelő lemezkép összeállítása
sr: — „disk-image“, изграђује слику диска, погодну за УСБ штапиће

source: - 'init', initialize a root file system to run GNU.
hu: - „init”, a gyökér fájlrendszer előkészítése a GNU futtatásához.
sr: — „init“, покреће корени систем датотека за покретање Гнуа.

source: --image-size=SIZE for 'vm-image', produce an image of SIZE
hu: --image-size=MÉRET a „vm-image”-hez, adott MÉRETŰ lemezkép előállítása
sr: --image-size=ВЕЛИЧИНА за „vm-image“, даје слику ВЕЛИЧИНЕ

source: --no-grub for 'init', do not install GRUB
hu: --no-grub az „init”-hez, ne telepítse a GRUB rendszerbetöltőt
sr: --no-grub за „init“, не инсталира ГРУБ

source: --full-boot for 'vm', make a full boot sequence
hu: --full-boot „vm” esetén, teljes indítási sorozat készítése

source: ~a: unknown action~%
hu: ~a: ismeretlen művelet~%
sr: ~a: непозната радња~%

source: wrong number of arguments for action '~a'~%
hu: nem megfelelő számú argumentum a(z) „~a” művelethez~%
sr: погрешан број аргумената за радњу „~a“~%

source: no configuration file specified~%
hu: nincs beállítófájl megadva~%
sr: није наведена датотека подешавања~%

source: Available checkers:~%
hu: Elérhető ellenőrzők:~%

source: Validate package descriptions
hu: Csomagleírások ellenőrzése

source: Identify inputs that should be native inputs
hu: Bemenetek azonosítása, amelyek natív bemenetek lehetnek

source: Validate filenames of patches
hu: Javítócsomagok fájlneveinek ellenőrzése

source: Validate package synopsis
hu: Csomagáttekintés ellenőrzése

source: Usage: guix lint [OPTION]... [PACKAGE]... Run a set of checkers on the specified package; if none is specified, run the checkers on all packages.
hu: Használat: guix lint [KAPCSOLÓ]… [CSOMAG]… Számos ellenőrző futtatása a megadott csomagon. Ha semmi sincs megadva, az ellenőrzők futtatása minden csomagon.

source: -c, --checkers=CHECKER1,CHECKER2... only run the specificed checkers
hu: -c, --checkers=ELLENŐRZŐ1,ELLENŐRZŐ2… csak a megadott ellenőrzők futtatása

source: -l, --list-checkers display the list of available lint checkers
hu: -l, --list-checkers az elérhető lint ellenőrzők listájának megjelenítése

source: ~a: invalid checker
hu: ~a: érvénytelen ellenőrző

source: signature verification failed for `~a'~%
hu: az aláírás-ellenőrzés sikertelen ennél: „~a”~%
sr: није успела провера потписа за „~a“~%

source: (could be because the public key is not in your keyring)~%
hu: (azért lehet, mert a nyilvános kulcs nincs a kulcstartón)~%
sr: (може бити зато што јавни кључ није у вашем привеску)~%

source: ~a: could not locate source file
hu: ~a: nem található a forrásfájl
sr: ~a: не могу да пронађем изворну датотеку

source: ~a: ~a: no `version' field in source; skipping~%
hu: ~a: ~a: nincs „version” mező a forrásban; kihagyás~%
sr: ~a: ~a: нема поља „version“ у извору; прескачем~%

source: failed to install locale: ~a~%
hu: a területi beállítás telepítése sikertelen: ~a~%
sr: нисам успео да инсталирам локалитет: ~a~%

source: Copyright (C) 2014 the Guix authors License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
hu: Copyright © 2014 a Guix szerzői Licenc GPLv3+: GNU GPL 3. vagy újabb verzió <http://gnu.org/licenses/gpl.html> Ez egy szabad szoftver, terjesztheti és/vagy módosíthatja. NINCS GARANCIA, a törvény által engedélyezett mértékig.
sr: Ауторска права (C) 2014 аутори Гуикса Лиценца ОЈЛв3+: ГНУ ОЈЛ издање 3 или касније <http://gnu.org/licenses/gpl.html> Ово је слободан софтвер: слободни сте да га мењате и расподељујете. Не постоји НИКАКВА ГАРАНЦИЈА, у оквирима дозвољеним законом.

source: Report bugs to: ~a.
hu: A hibákat ide jelentse: ~a.
sr: Грешке пријавите на: ~a.

source: ~a home page: <~a>
hu: ~a honlap: <~a>
sr: ~a матична страница: <~a>

source: General help using GNU software: <http://www.gnu.org/gethelp/>
hu: Általános segítség a GNU szoftverek használatához: <http://www.gnu.org/gethelp/>
sr: Општа помоћ користећи ГНУ софтвер: <http://www.gnu.org/gethelp/>

source: ~a: invalid number~%
hu: ~a: érvénytelen szám~%
sr: ~a: неисправан број~%

source: invalid number: ~a~%
hu: érvénytelen szám: ~a~%
sr: неисправан број: ~a~%

source: unknown unit: ~a~%
hu: ismeretlen egység: ~a~%
sr: непозната јединица: ~a~%

source: ~a:~a:~a: package `~a' has an invalid input: ~s~%
hu: ~a:~a:~a: a(z) „~a” csomagnak érvénytelen bemenete van: ~s~%
sr: ~a:~a:~a: пакет „~a“ садржи неисправан улаз: ~s~%

source: ~a: ~a: build system `~a' does not support cross builds~%
hu: ~a: ~a: a(z) „~a” összeállítási rendszer nem támogatja a kereszt összeállításokat~%
sr: ~a: ~a: систем изградње „~a“ не садржи унакрсне изградње~%

source: profile '~a' does not exist~%
hu: a(z) „~a” profil nem létezik~%
sr: профил „~a“ не постоји~%

source: generation ~a of profile '~a' does not exist~%
hu: a(z) ~a generáció a(z) „~a” profilhoz nem létezik~%

source: failed to connect to `~a': ~a~%
hu: sikertelen csatlakozás ehhez: „~a”: ~a~%
sr: нисам успео да се повежем на „~a“: ~a~%

source: build failed: ~a~%
hu: az összeállítás sikertelen: ~a~%
sr: изградња није успела: ~a~%

source: failed to read expression ~s: ~s~%
hu: a(z) ~s kifejezés olvasása sikertelen: ~s~%
sr: нисам успео да прочитам израз ~s: ~s~%

source: failed to evaluate expression `~a': ~s~%
hu: a(z) „~a” kifejezés kiértékelése sikertelen: ~s~%
sr: нисам успео да проценим израз „~a“: ~s~%

source: expression ~s does not evaluate to a package~%
hu: a(z) ~s kifejezés nem értékelhető ki a csomaghoz~%
sr: израз „~s“ се не процењује на пакет~%

source: ~:[The following derivation would be built:~%~{ ~a~%~}~;~]
hu: ~:[A következő származékot kellene összeállítani:~%~{ ~a~%~}~;~]
sr: ~:[Следећа изводница би требала бити изграђена:~%~{ ~a~%~}~;~]

source: ~:[The following file would be downloaded:~%~{ ~a~%~}~;~]
hu: ~:[A következő fájlt kellene letölteni:~%~{ ~a~%~}~;~]
sr: ~:[Следећа датотека би требала бити преузета:~%~{ ~a~%~}~;~]

source: ~:[The following derivation will be built:~%~{ ~a~%~}~;~]
hu: ~:[A következő származék lesz összeállítva:~%~{ ~a~%~}~;~]
sr: ~:[Следећа изводница ће бити изграђена:~%~{ ~a~%~}~;~]

source: ~:[The following file will be downloaded:~%~{ ~a~%~}~;~]
hu: ~:[A következő fájl lesz letöltve:~%~{ ~a~%~}~;~]
sr: ~:[Следећа датотека ће бити преузета:~%~{ ~a~%~}~;~]

source: The following package would be removed:~%~{~a~%~}~%
hu: A következő csomagot el kellene távolítani:~%~{~a~%~}~%
sr: Следећи пакети би требали бити уклоњени:~%~{~a~%~}~%

source: The following package will be removed:~%~{~a~%~}~%
hu: A következő csomag el lesz távolítva:~%~{~a~%~}~%
sr: Следећи пакети ће бити уклоњени:~%~{~a~%~}~%

source: The following package would be upgraded:~%~{~a~%~}~%
hu: A következő csomagot kellene frissíteni:~%~{~a~%~}~%

source: The following package will be upgraded:~%~{~a~%~}~%
hu: A következő csomag lesz frissítve:~%~{~a~%~}~%

source: The following package would be installed:~%~{~a~%~}~%
hu: A következő csomagot kellene telepíteni:~%~{~a~%~}~%
sr: Следећи пакети би требали бити инсталирани:~%~{~a~%~}~%

source: The following package will be installed:~%~{~a~%~}~%
hu: A következő csomag lesz telepítve:~%~{~a~%~}~%
sr: Следећи пакети ће бити инсталирани:~%~{~a~%~}~%

source: <unknown location>
hu: <ismeretlen hely>
sr: <непознато место>

source: failed to create configuration directory `~a': ~a~%
hu: a(z) „~a” beállítási könyvtár létrehozása sikertelen: ~a~%
sr: нисам успео да направим директоријум подешавања „~a“: ~a~%

source: unknown
hu: ismeretlen
sr: непознато

source: invalid argument: ~a~%
hu: érvénytelen argumentum: ~a~%
sr: неисправан аргумент: ~a~%

source: Try `guix --help' for more information.~%
hu: További információkért próbálja a „guix --help” parancsot.~%
sr: Пробајте „guix --help“ за више података.~%

source: Usage: guix COMMAND ARGS... Run COMMAND with ARGS.
hu: Használat: guix PARANCS ARGUMENTUMOK… A PARANCS futtatása ARGUMENTUMOKKAL.
sr: Употреба: guix НАРЕДБА АРГУМЕНТИ... Покрените НАРЕДБУ са АРГУМЕНТИМА.

source: COMMAND must be one of the sub-commands listed below:
hu: A PARANCSNAK a lenti listában lévő alparancsok egyikének kell lennie:
sr: НАРЕДБА мора бити једна од подкоманди наведених испод:

source: guix: ~a: command not found~%
hu: guix: ~a: a parancs nem található~%
sr: guix: ~a: нисам пронашао наредбу~%

source: guix: missing command name~%
hu: guix: hiányzó parancsnév~%
sr: guix: недостаје назив наредбе~%

source: guix: unrecognized option '~a'~%
hu: guix: ismeretlen kapcsoló: „~a”~%
sr: guix: непозната опција „~a“~%

source: using Guile ~a, which does not support ~s encoding~%
hu: a Guile ~a használata, amely nem támogatja a(z) ~s kódolást~%
sr: користим Гуиле ~a, који не подржава ~s кодирање~%

source: download failed; use a newer Guile~%
hu: letöltés sikertelen; használja a Guile újabb verzióját~%
sr: преузимање није успело; користите новији Гуиле~%

source: following redirection to `~a'...~%
hu: átirányítás követése ide: „~a”…~%
sr: пратим преусмеравање на „~a“...~%

source: download failed
hu: letöltés sikertelen
sr: преузимање није успело

source: signature is not a valid s-expression
hu: az aláírás nem érvényes s-kifejezés
sr: потпис није исправан с-израз

source: invalid signature
hu: érvénytelen aláírás
sr: неисправан потпис

source: invalid hash
hu: érvénytelen hash
sr: неисправан хеш

source: unauthorized public key
hu: jogosulatlan nyilvános kulcs
sr: неовлашћени јавни кључ

source: corrupt signature data
hu: sérült aláírás adatok
sr: оштећени подаци потписа

source: corrupt file set archive
hu: sérült fájlhalmaz archívum
sr: оштећена датотека скупа архиве

source: importing file or directory '~a'...~%
hu: fájl vagy könyvtár importálása: „~a”…~%
sr: увозим датотеку или директоријум „~a“...~%

source: found valid signature for '~a'~%
hu: érvényes aláírás található ehhez: „~a”~%
sr: нађох исправан потпис за „~a“~%

source: imported file lacks a signature
hu: az importált fájl egy aláírást hiányol
sr: увезеној датотеци недостаје потпис

source: invalid inter-file archive mark
hu: érvénytelen belső-fájl archívum jelölő
sr: неисправан знак архиве унутрашње датотеке

source: unexpected executable file marker
sr: неочекивани означавач извршне датотеке

source: unsupported nar file type
sr: неподржана врста нар датотеке

source: unsupported file type
sr: неподржана врста датотеке

source: invalid nar signature
sr: неисправан нар потпис

source: invalid nar end-of-file marker
sr: неисправан нар означавач краја датотеке

source: invalid symlink tokens
sr: неисправна обележја симболичке везе

source: unexpected directory entry termination
sr: неочекивано окончање уноса директоријума

source: unexpected directory inter-entry marker
sr: неочекивани означавач унутрашњег уноса директоријума

source: unsupported nar entry type
sr: неподржана врста нар уноса
