Repository: guix-mirror/guix
Catalog: po/*.po
Languages: eo, pt_br, vi

source: cannot access `~a': ~a~%
eo: ne eblas atingi '~a': ~a~%
pt_br: não foi possível acessar "~a": ~a~%
vi: không thể truy cập `~a': ~a~%

source: Hello, GNU world: An example GNU package
eo: Saluton, mondo GNU: ekzemplo de pako GNU
pt_br: Olá, mundo GNU: Um exemplo de pacote GNU
vi: Xin chào, gia đình GNU: Một gói GNU ví dụ

source: Print lines matching a pattern
eo: Montri liniojn kongruajn al ŝablono
pt_br: Exibe linhas correspondendo a um padrão
vi: In ra những dòng khớp với một mẫu

source: Stream editor
eo: Flu-redaktilo
pt_br: Editor de fluxo
vi: Trình soạn thảo luồng dữ liệu

source: Managing tar archives
eo: Administrado de arĥivoj tar
pt_br: Gerenciando de arquivos-tar
vi: Quản lý kho lưu tar

source: Apply differences to originals, with optional backups
eo: Apliki malsamojn al originaloj, kun nedevigaj savkopioj
pt_br: Aplica diferenças aos originais, com backups opcionais
vi: Áp dụng những khác biệt này vào bản gốc, với các sao lưu tùy chọn

source: Comparing and merging files
eo: Komparo kaj kunmikso de dosieroj
pt_br: Comparando e mesclando arquivos
vi: So sánh và hòa trộn các tập tin

source: Operating on files matching given criteria
eo: Operacio sur dosieroj kongruantaj al indikia kriterio
pt_br: Operação em arquivos correspondendo aos critérios dados
vi: Thực hiện trên những tập tin khớp với điều kiện đã cho

source: Core GNU utilities (file, text, shell)
eo: Nukleaj utilaĵoj GNU (file, text, shell)
pt_br: Utilitários centrais do GNU (file, text, shell)
vi: Tiện ích lõi GNU (file, text, shell)

source: Remake files automatically
eo: Reprocezi dosierojn aŭtomate
pt_br: Refaz arquivos automaticamente
vi: Tạo lại các tập tin một cách tự động

source: Binary utilities: bfd gas gprof ld
eo: Duumaj utilaĵoj: bfd gas gprof ld
pt_br: Utilitários de binários: bfd gas gprof ld
vi: Tiện ích nhị phân: bfd gas gprof ld

source: The GNU C Library
eo: La Biblioteko GNU C
pt_br: A GNU C Library
vi: Thư viện C từ GNU

source: Database of current and historical time zones
eo: Datumbazo de nuna kaj pasintaj temp-zonoj
pt_br: Banco de dados de fusos horários históricos e atuais
vi: Cơ sở dữ liệu của hiện tại và múi giờ lịch sử

source: GNU C++ standard library (intermediate)
eo: GNU C++ norma biblioteko (intermeza)
vi: Thư viện GNU C++ chuẩn (khâu trung gian)

source: The linker wrapper
eo: La ligila ĉirkaŭanto
pt_br: A interface do linker
vi: Bộ bao liên kết

source: Scheme implementation intended especially for extensions
eo: Realigo de Scheme celata speciale por aldonoj
pt_br: Implementação de Scheme com intenção especialmente para extensões
vi: Lược đồ thực thi có dụng ý đặc biệt cho phần mở rộng

source: Framework for building readers for GNU Guile
eo: Framo por konstrui legilojn por GNU Guile
pt_br: Infraestrutura para compilação de leitores para GNU Guile
vi: Một framework để xây dựng bộ đọc dành cho GNU Guile

source: Guile bindings to ncurses
eo: Bindoj de Guile por ncurses
pt_br: Bindings de Guile para ncurses
vi: Guile ràng buộc vào ncurses

source: Run jobs at scheduled times
eo: Lanĉi taskoj je antaŭplanitaj horoj
pt_br: Executa trabalhos no horário agendado
vi: Chạy các công việc theo lịch biểu

source: Collection of useful Guile Scheme modules
eo: Aro da utilaj moduloj de Guile Scheme
pt_br: Coleção de módulos úteis de Scheme de Guile
vi: Bộ sưu tập của các mô-đun Lược đồ Guile

source: Guile bindings to libssh
vi: Guile ràng buộc vào libssh

source: Manipulate plain text files as databases
eo: Manipuli simplajn tekst-dosierojn kiel datumbazojn
pt_br: Manipula arquivos texto simples como banco de dados
vi: Thao tác các tập tin văn bản thường như là cơ sở dữ liệu

source: package `~a' has no source~%
pt_br: pacote "~a" não possui fontes~%
vi: gói `~a' không có nguồn~%

source: Usage: guix build [OPTION]... PACKAGE-OR-DERIVATION... Build the given PACKAGE-OR-DERIVATION and return their output paths.
eo: Uzado: guix build [MODIFILO]... PAKO-AŬ-DERIVAĴO... Konstrui la indikitan PAKO-AŬ-DERIVAĴOn kaj montri iliajn eligajn vojojn.
pt_br: Uso: guix build [OPÇÃO]... PACOTE-OU-DERIVAÇÃO... Compila o PACOTE-OU-DERIVAÇÃO dado e returna seus caminhos de saída.
vi: Cách dùng: guix build [TÙY-CHỌN]... PACKAGE-OR-DERIVATION... Xây dựng PACKAGE-OR-DERIVATION đã cho và trả về đường dẫn kết xuất của chúng.

source: -e, --expression=EXPR build the package or derivation EXPR evaluates to
eo: -e, --expression=ESPR konstrui la pakon aŭ derivaĵon kiu rezultas de ESPR
vi: -e, --expression=BThức xây dựng gói hay tìm nguồn gốc BTthức lượng giá cho

source: -S, --source build the packages' source derivations
eo: -S, --source konstrui la font-derivaĵojn de la pakoj
pt_br: -S, --source compila as derivações de fontes do pacote
vi: -S, --source xây dựng nguồn gốc mã nguồn của gói

source: -s, --system=SYSTEM attempt to build for SYSTEM--e.g., "i686-linux"
eo: -s, --system=SISTEMO provi konstrui por SISTEMO--ekz., "i686-linux"
pt_br: -s, --system=SISTEMA tenta compilar para SISTEMA. ex.: "i686-linux"
vi: -s, --system=HỆ-THỐNG cố xây dựng cho HỆ-THỐNG--ví dụ: "i686-linux"

source: --target=TRIPLET cross-build for TRIPLET--e.g., "armel-linux-gnu"
eo: --target=TRIOPO cruc-konstrui por TRIOPO--ekz., "armel-linux-gnu"
pt_br: --target=TRIO compilação cruzada para TRIO. ex.: "armel-linux-gnu"
vi: --target=TRIPLET biên dịch chéo cho BỘ BA--ví dụ: "armel-linux-gnu"

source: -d, --derivations return the derivation paths of the given packages
eo: -d, --derivations liveri la derivaĵajn vojojn de la indikitaj pakoj
pt_br: -d, --derivations retorna os caminhos de derivação dos pacotes dados
vi: -d, --derivations trả về các đường dẫn nguồn gốc của các gói đã cho

source: -K, --keep-failed keep build tree of failed builds
eo: -K, --keep-failed teni konstru-arbon el fiaskintaj konstruoj
pt_br: -K, --keep-failed mantém a árvore de compilado de pacotes falhos
vi: -K, --keep-failed giữ lại cây xây dựng của lần xây dựng gặp lỗi

source: -n, --dry-run do not build the derivations
eo: -n, --dry-run ne konstrui derivaĵojn
pt_br: -n, --dry-run não compila as derivações
vi: -n, --dry-run không xây dựng dẫn xuất

source: --fallback fall back to building when the substituter fails
eo: --fallback retropaŝi al konstruado kiam la anstataŭiganto fiaskas
pt_br: --fallback volta para compilação quando o substituto falhar
vi: --roll-back quay lại dịch khi `substituter' thất bại

source: --no-substitutes build instead of resorting to pre-built substitutes
eo: --no-substitutes konstrui anstataŭ provi jam-konstruitajn anstataŭigantojn
pt_br: --no-substitutes compila, em vez de recorrer a substitutos pré-construídos
vi: --no-substitutes xây dựng thay vì nhờ vào phần thay thế được dựng trước

source: --max-silent-time=SECONDS mark the build as failed after SECONDS of silence
eo: --max-silent-time=SEKUNDOJ marki la konstruo kiel fiaskinta post SEKUNDOJ da silento
pt_br: --max-silent-time=SEGUNDOS marca compilação como falha após SEGUNDOS de silêncio
vi: --max-silent-time=GIÂY đánh dấu là việc dịch sẽ là lỗi nếu lâu hơn số GIÂY này

source: -c, --cores=N allow the use of up to N CPU cores for the build
eo: -c, --cores=N permesigi uzon de ĝis N CPU-nukleojn por la konstruo
pt_br: -c, --cores=N permite o uso de até N núcleos de CPU para compilação
vi: -c, --cores=N cho dùng đến N lõi CPU cho công việc xây dựng

source: -r, --root=FILE make FILE a symlink to the result, and register it as a garbage collector root
eo: -r, --root=DOSIERO igi DOSIEROn simbola ligo al la rezulto, kaj registri ĝin kiel radikon de rubaĵ-kolektanto
pt_br: -r, --root=ARQUIVO faz do ARQUIVO um link simbólico para o resultado e registra-o, como um coletor de lixo
vi: -r, --root=TẬP-TIN tạo TẬP-TIN một liên kết mềm đến kết quả, và đăng ký nó như là bộ gom rác gốc

source: --verbosity=LEVEL use the given verbosity LEVEL
eo: --verbosity=NIVELO uzi la indikitan detaligan NIVELOn
pt_br: --verbosity=NÍVEL usa o NÍVEL de detalhamento dado
vi: --verbosity=MỨC dùng mức chi tiết đã cho

source: --log-file return the log file names for the given derivations
eo: --log-file liveri la protokol-dosierajn nomojn por la indikitaj derivaĵoj
vi: --log-file trả về tên của tập-tin nhật ký cho dẫn xuất đã cho

source: -h, --help display this help and exit
eo: -h, --help montri ĉi tiun helpon kaj eliri
pt_br: -h, --help exibe esta ajuda e sai
vi: -h, --help hiển thị trợ giúp này rồi thoát

source: -V, --version display version information and exit
eo: -V, --version montri informon pri versio kaj eliri
pt_br: -V, --version exibe informações da versão e sai
vi: -V, --version hiển thị thông tin phiên bản rồi thoát

source: ~a: not a number~%
eo: ~a: ne estas numero~%
pt_br: ~a: não é um número~%
vi: ~a: không phải con số~%

source: ~A: unrecognized option~%
eo: ~A: nerekonata modifilo~%
pt_br: ~A: opção desconhecida~%
vi: ~A: tùy chọn không được chấp nhận~%

source: failed to create GC root `~a': ~a~%
eo: fiasko dum kreo de radiko GC '~a': ~a~%
pt_br: falha ao criar raiz de GC "~a": ~a~%
vi: gặp lỗi khi tạo gốc GC `~a': ~a~%

source: ambiguous package specification `~a'~%
eo: plursenca pak-specifigo '~a'~%
pt_br: especificação ambígua de pacote "~a"~%
vi: đặc tả gói chưa rõ ràng `~a'~%

source: choosing ~a from ~a~%
eo: ni elektas ~a el ~a~%
pt_br: escolhendo ~a de ~a~%
vi: chọn ~a từ ~a~%

source: ~A: package not found for version ~a~%
eo: ~A: pako ne trovita por versio ~a~%
pt_br: ~A: pacote não encontrado para versão ~a~%
vi: ~A: gói không tìm thấy cho phiên bản ~a~%

source: ~A: unknown package~%
eo: ~A: nekonata pako~%
pt_br: ~A: pacote desconhecido~%
vi: ~A: không hiểu gói ~%

source: no build log for '~a'~%
eo: neniu konstruita protokolo por '~a'~%
vi: không có nhật ký dịch cho '~a'~%

source: Usage: guix download [OPTION] URL Download the file at URL, add it to the store, and print its store path and the hash of its contents. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
eo: Uzmaniero: guix download [OPTION] URL Elŝuti la dosieron ĉe la URL, aldoni ĝin al la konservejo, kaj montri ĝian konservo-vojon kaj la haketon de ĝia enhavo. Subtenataj formoj: 'nix-base32' (aprioras), 'base32', kaj 'base16' ('hex' kaj 'hexadecimal' ankaŭ uzeblas, por deksesumo).
pt_br: Uso: guix download [OPÇÃO] URL Baixa o arquivo na URL, adiciona-o para o armazenamento e exibe o caminho de seu armazenamento e o hash de seu conteúdo. Suporte a formatos: "nix-base32" (padrão), "base32" e "base16" ("hex" e "hexadecimal" também podem ser usados).
vi: Cách dùng: guix download [TÙY-CHỌN] URL Tải về tập tin từ URL, thêm nó vào kho chứa, và in đường dẫn và mã băm nội dung của nó. Các định dạng được hỗ trợ: 'nix-base32' (mặc định), 'base32', và 'base16' (dùng 'hex' và 'hexadecimal' cũng được).

source: -f, --format=FMT write the hash in the given format
eo: -f, --format=FRM skribi la haketon laŭ la indikita formo
pt_br: -f, --format=FMT escreve o hash no formato FMT dado
vi: -f, --format=FMT ghi mã băm theo định dạng đã cho

source: unsupported hash format: ~a~%
eo: nesubtenata haket-formo: ~a~%
pt_br: sem suporte ao formato de hash: ~a~%
vi: định dạng băm không được hỗ trợ: ~a~%

source: ~a: failed to parse URI~%
eo: ~a: analizo de URI fiaskis~%
pt_br: ~a: falha ao analisar URI~%
vi: ~a: gặp lỗi khi phân tích URI~%

source: ~a: download failed~%
eo: ~a: elŝuto fiaskis~%
pt_br: ~a: falha no download~%
vi: ~a: tải về gặp lỗi~%

source: failed to build the empty profile~%
eo: fiasko dum konstruo de malplena profilo~%
pt_br: falha ao compilar o perfil vazio~%
vi: gặp lỗi khi xây dựng hồ sơ trống rỗng~%

source: switching from generation ~a to ~a~%
eo: alterno el generacio ~a al ~a~%
pt_br: trocando para geração de ~a para ~a~%
vi: chuyển từ thế hệ ~a sang ~a~%

source: profile '~a' does not exist~%
eo: profilo '~a' ne ekzistas~%
pt_br: perfil "~a" não existe~%
vi: hồ sơ `~a' không tồn tại~%

source: nothing to do: already at the empty profile~%
eo: nenio por fari: jam estas ĉe la malplena profilo~%
pt_br: nada a ser feito: já está no perfil vazio~%
vi: không có gì cần làm: đã là một hồ sơ trống rỗng~%

source: The following package would be removed:~%~{~a~%~}~%
eo: La jena pako devos esti forigata:~%~{~a~%~}~%
vi: Gói sau đây sẽ bị gỡ bỏ:~%~{~a~%~}~%

source: The following package will be removed:~%~{~a~%~}~%
eo: La jena pako estos forigata:~%~{~a~%~}~%
vi: Gói sau đây sẽ bị gỡ bỏ:~%~{~a~%~}~%

source: The following package would be installed:~%~{~a~%~}~%
eo: La jena pako estus instalata:~% ~{~a~%~}~%
pt_br: O seguinte pacote seria instalado:~%~{~a~%~}~%
vi: Gói sau đây sẽ được cài đặt:~%~{~a~%~}~%

source: The following package will be installed:~%~{~a~%~}~%
eo: La jena pako estos instalata:~% ~{~a~%~}~%
pt_br: O seguinte pacote será instalado:~%~{~a~%~}~%
vi: Gói sau đây sẽ được cài đặt:~%~{~a~%~}~%

source: package `~a' lacks output `~a'~%
eo: pako '~a' malhavas eligon '~a'~%
pt_br: pacote "~a" carece de mensagem de saída "~a"~%
vi: gói `~a' thiếu kết xuất `~a'~%

source: ~a: package not found~%
eo: ~a: pako ne trovita~%
pt_br: ~a: pacote não encontrado~%
vi: ~a: không tìm thấy gói~%

source: looking for the latest release of GNU ~a...
eo: ni serĉas la lastan eldonon de GNU ~a...
pt_br: procurando pelo último lançamento do GNU ~a...
vi: tìm bản phát hành mới nhất ~a GNU...

source: ~a: note: using ~a but ~a is available upstream~%
eo: ~a: rimarko: ni uzas ~a sed ~a disponeblas unuanivele~%
pt_br: ~a: nota: usando ~a, mas ~a está disponível no upstream~%
vi: ~a: ghi chú: dùng ~a nhưng ~a thì sẵn sàng trên thượng nguồn~%

source: The following environment variable definitions may be needed:~%
eo: La jenaj medi-variablaj difinoj povos esti necesaj:~%
pt_br: As seguintes definições de variável de ambiente podem ser necessárias:~%
vi: Những định nghĩa biến môi trường sau đây là cần thiết:~%

source: Usage: guix package [OPTION]... PACKAGES... Install, remove, or upgrade PACKAGES in a single transaction.
eo: Uzmaniero: guix package [MODIFILO]... PAKOJ... Instalas, forigas, aŭ ĝisdatigas PAKOJn en ununura ago.
pt_br: Uso: guix package [OPÇÃO]... PACOTES... Instala, remove ou atualiza PACOTES em uma única transação.
vi: Cách dùng: guix package [TÙY-CHỌN]... GÓI... Cài đặt, gỡ bỏ hay cập nhật GÓI trong một giao dịch đơn.

source: -i, --install=PACKAGE install PACKAGE
eo: -i, --install=PAKO instali PAKOn
pt_br: -i, --install=PACOTE instala PACOTE
vi: -i, --install=GÓI cài đặt GÓI

source: -e, --install-from-expression=EXP install the package EXP evaluates to
eo: -e, --install-from-expression=ESP instali la pakon ESP rezultas al
pt_br: -e, --install-from-expression=EXP instala o pacote que EXPR corresponder
vi: -e, --install-from-expression=BT cài đặt gói được BT định giá cho

source: -r, --remove=PACKAGE remove PACKAGE
eo: -r, --remove=PAKO forigi PAKOn
pt_br: -r, --remove=PACOTE remove PACOTE
vi: -r, --remove=GÓI gỡ bỏ GÓI

source: -u, --upgrade[=REGEXP] upgrade all the installed packages matching REGEXP
eo: -u, --upgrade[=REGESP] ĝisdatigi ĉiujn instalitajn pakojn kongruantajn al REGESP
pt_br: -u, --upgrade[=REGEXP] atualiza todos os pacotes instalados correspondendo à REGEXP
vi: -u, --upgrade[=BTCQ] cập nhật tất cả các gói khớp với BTCQ

source: --roll-back roll back to the previous generation
eo: --roll-back retropaŝi al la antaŭa generacio
pt_br: --roll-back Reverte para a geração anterior
vi: --roll-back quay lại thế hệ trước

source: --search-paths display needed environment variable definitions
eo: --search-paths montri necesajn medi-variablajn difinojn
pt_br: --search-paths exibe definições necessárias de variável de ambiente
vi: --search-paths hiển thị các định nghĩa biến môi trường cần thiết

source: -l, --list-generations[=PATTERN] list generations matching PATTERN
eo: -I, --list-generations[=ŜABLONO] listigi generaciojn kongruantajn al ŜABLONO
pt_br: -I, --list-generations[=PADRÃO] lista criações correspondendo ao PADRÃO
vi: -l, --list-generations[=MẪU] liệt kê các gói khớp MẪU

source: -d, --delete-generations[=PATTERN] delete generations matching PATTERN
eo: -d, --delete-generations[=ŜABLONO] forigi generaciojn kongruantajn al ŜABLONO
vi: -d, --delete-generations[=MẪU] xóa các bộ tạo khớp MẪU

source: -p, --profile=PROFILE use PROFILE instead of the user's default profile
eo: -p, --profile=PROFILO uzi PROFILOn anstataŭ la apriora profilo de la uzanto
pt_br: -p, --profile=PERFIL usa PERFIL em vez do perfil padrão do usuário
vi: -p, --profile=PROFILE dùng hồ sơ đưa ra thay cho hồ sơ mặc định

source: -n, --dry-run show what would be done without actually doing it
pt_br: -n, --dry-run mostra o que seria feito sem fazê-lo
vi: -n, --dry-run hiển thị những gì được làm nhưng không thực hiện thật

source: --bootstrap use the bootstrap Guile to build the profile
eo: --bootstrap uzi la praŝargilon Guile por konstrui la profilon
pt_br: --bootstrap usa a inicialização do Guile para compilar o perfil
vi: --bootstrap dùng chương trình mồi Guile để xây dựng hồ sơ

source: --verbose produce verbose output
eo: --verbose produkti detalplenan eligon
pt_br: --verbose produz uma saída mais detalhada
vi: --verbose tạo ra kết xuất chi tiết

source: -s, --search=REGEXP search in synopsis and description using REGEXP
eo: -s, --search=REGESP serĉi en resumo kaj priskribo uzante REGESP
pt_br: -s, --search=REGEXP pesquisa na sinopse e descrição usando REGEXP
vi: -s, --search=BTCQ tìm trong tóm lược và mô tả sử dụng BIỂU THỨC CHÍNH QUY

source: -I, --list-installed[=REGEXP] list installed packages matching REGEXP
eo: -I, --list-installed[=REGESP] listigi instalitajn pakojn kongruantajn al REGESP
pt_br: -I, --list-installed[=REGEXP] lista pacotes instalados correspondentes a REGEXP
vi: -I, --list-installed[=BIỂU-THỨC-CHÍNH-QUY] kiệt kê các gói khớp BTCQ đã cài đặt

source: -A, --list-available[=REGEXP] list available packages matching REGEXP
eo: -A, --list-available[=REGESP] listigi disponeblajn pakojn kongruantajn al REGESP
pt_br: -A, --list-available[=REGEXP] lista pacotes disponíveis correspondentes a REGEXP
vi: -A, --list-available[=BIỂU-THỨC-CHÍNH-QUY] kiệt kê các gói khớp BTCQ

source: ~A: extraneous argument~%
eo: ~A: fremda argumento~%
pt_br: ~A: argumento estranho~%
vi: ~A: đối số ngoại lai~%

source: Try "info '(guix) Invoking guix package'" for more information.~%
eo: Provu "info '(guix) Invoking guix package'" por pli da informo.'%
pt_br: Tente "info '(guix) Invoking guix package'" para mais informações.~%
vi: Thử chạy lệnh "info '(guix) Invoking guix package'" để có thêm thông tin.~%

source: error: while creating directory `~a': ~a~%
eo: eraro: dum kreo de dosierujo '~a': ~a~%
pt_br: erro: ao criar diretório "~a": ~a~%
vi: lỗi: trong khi tạo thư mục `~a': ~a~%

source: Please create the `~a' directory, with you as the owner.~%
eo: Bonvolu krei la dosierujon '~a', kun vi kiel posedanto.~%
pt_br: Por favor, crie o diretório "~a", com você sendo o proprietário.~%
vi: Hãy tạo thư mục `~a', với bạn là chủ sở hữu.~%

source: error: directory `~a' is not owned by you~%
eo: eraro: dosierujo '~a' ne estas posedata de vi~%
pt_br: erro: diretório "~a" não tem você como proprietário~%
vi: lỗi: thư mục `~a' không được sở hữu bởi bạn~%

source: Please change the owner of `~a' to user ~s.~%
eo: Bonvole ŝanĝu la posedanton de '~a' al la uzanto ~s.~%
pt_br: Por favor, altere o proprietário d "~a" para o usuário ~s.~%
vi: Vui lòng đổi chủ sở hữu của `~a' thành ~s.~%

source: deleting ~a~%
eo: ni forigas ~a~%
vi: đang xóa ~a~%

source: invalid syntax: ~a~%
eo: malvalida sintakso: ~a~%
pt_br: sintaxe inválida: ~a~%
vi: cú pháp không hợp lệ: ~a~%

source: nothing to be done~%
eo: nenio por fari~%
pt_br: nada para ser feito~%
vi: không có gì cần làm~%

source: ~a package in profile~%
eo: pako ~a en profilo~%
pt_br: pacote ~a no perfil~%
vi: ~a gói trong hồ sơ~%

source: Generation ~a ~a
eo: Generacio ~a ~a
vi: Tạo ~a ~a

source: ~a (current)~%
eo: ~a (nuna)~%
vi: ~a (hiện tại)~%

source: Usage: guix gc [OPTION]... PATHS... Invoke the garbage collector.
eo: Uzmaniero: guix gc [MODIFILO]... VOJOJ... Voki la rubaĵ-kolektanton.
pt_br: Uso: guix gc [OPÇÃO]... CAMINHOS... Chama o coletor de lixo.
vi: Cách dùng: guix gc [TÙY-CHỌN]... ĐƯỜNG DẪN... Gọi bộ sưu tập rác.

source: -C, --collect-garbage[=MIN] collect at least MIN bytes of garbage
eo: -C, --collect-garbage[=MIN] kolekti minimume MIN bajtojn da rubaĵo
pt_br: -C, --collect-garbage[=MÍN] coleta pelo menos MÍN bytes de lixo
vi: -C, --collect-garbage[=TỐI-THIỂU] sưu tập TỐI-THIỂU byte rác

source: -d, --delete attempt to delete PATHS
eo: -d, --delete provi forigi VOJOJn
pt_br: -d, --delete tente excluir CAMINHOS
vi: -d, --delete cố xóa ĐƯỜNG-DẪN

source: --list-dead list dead paths
eo: --list-dead listigi mortajn vojojn
pt_br: --list-dead lista caminhos mortos (inalcançáveis)
vi: --list-dead liệt kê các đường dẫn đã chết

source: --list-live list live paths
eo: --list-live listigi aktivajn vojojn
pt_br: --list-live lista caminhos vivos (ativos)
vi: --list-live liệt kê đường dẫn còn sống

source: --references list the references of PATHS
eo: --references listigi la referencojn de VOJOJ
pt_br: --references lista as referências de CAMINHOS
vi: --references liệt kê câs tham chiếu của ĐƯỜNG-DẪN

source: -R, --requisites list the requisites of PATHS
eo: -R, --requisites listigi la antaŭbezonojn de VOJOJ
pt_br: -R, --requisites lista os requisitos de CAMINHOS
vi: -R, --referrers liệt kê các điều kiện cần cho biến PATH

source: --referrers list the referrers of PATHS
eo: --referrers listigi la referencantojn de VOJOJ
pt_br: --referrers lista as referências de CAMINHOS
vi: --referrers liệt kê các ĐƯỜNG DẪN cho biến PATH

source: unknown unit: ~a~%
eo: nekonata unuo: ~a~%
pt_br: unidade desconhecida: ~a~%
vi: không hiểu đơn vị: ~a~%

source: invalid number: ~a~%
eo: nevalida numero: ~a~%
pt_br: número inválido: ~a~%
vi: số không hợp lệ: ~a~%

source: invalid amount of storage: ~a~%
eo: nevalida kvanto da konserv-spaco: ~a~%
pt_br: quantidade inválida de armazenamento: ~a~%
vi: số lượng kho chứa không hợp lệ: ~a~%

source: Usage: guix hash [OPTION] FILE Return the cryptographic hash of FILE. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
pt_br: Uso: guix hash [OPÇÃO] ARQUIVO Retorna o hash criptográfico do ARQUIVO. Suporte a formatos: "nix-base32" (padrão), "base32" e "base16" ("hex" e "hexadecimal" também podem ser usados).
vi: Cách dùng: guix hash [TÙY-CHỌN] TẬP-TIN Trả về mã băm của TẬP-TIN. Các định dạng được hỗ trợ: 'nix-base32' (mặc định), 'base32', và 'base16' ('hex' và 'hexadecimal' có thể được dùng cũng tốt).

source: unrecognized option: ~a~%
eo: nerekonata modifilo: ~a~%
pt_br: opção desconhecida: ~a~%
vi: tùy chọn không được thừa nhận: ~a~%

source: wrong number of arguments~%
eo: malĝusta nombro da argumentoj~%
pt_br: número errado de argumentos~%
vi: số lượng đối số không đúng~%

source: Usage: guix pull [OPTION]... Download and deploy the latest version of Guix.
eo: Uzmaniero: guix pull [MODIFILO]... Elŝuti kaj liveri la lastan version de Guix.
pt_br: Uso: guix pull [OPÇÃO]... Baixa e implanta a última versão do Guix.
vi: Cách dùng: guix pull [TÙY-CHỌN]... Tải về và khai triển phiên bản mới nhất của Guix.

source: --url=URL download the Guix tarball from URL
eo: --url=URL elŝuti la tar-dosiero de Guix el URL
vi: --url=URL tải gói Guix từ URL

source: --bootstrap use the bootstrap Guile to build the new Guix
eo: --bootstrap uzi la 'bootstrap' Guile por konstrui novan Guix
pt_br: --bootstrap usa a inicialização do Guile para compilar o novo Guix
vi: --bootstrap dùng chương trình mồi Guile để xây dựng Guix

source: ~A: unexpected argument~%
eo: ~A: neatendita argumento~%
pt_br: ~A: argumento inesperado~%
vi: ~A: gặp đối số bất thường~%

source: failed to download up-to-date source, exiting
eo: fiasko dum elŝuto de aktuala fonto, ni ĉesas
pt_br: falha ao baixar fonte atualizada; saindo
vi: gặp lỗi khi tải về cập nhật mới nhất của mã nguồn, đang thoát
