Repository: guix-mirror/guix
Catalog: po/*.po
Languages: eo, pt_br, vi

source: updated ~a successfully deployed under `~a'~%
eo: ni ĝisdatigis ~a sukcese, liverita sur '~a'~%
pt_br: ~a atualizado foi implantado com sucesso em "~a"~%
vi: đã cập nhật ~a thành công được triển khai dưới `~a'~%

source: failed to update Guix, check the build log~%
eo: fiasko dum ĝisdatigo de Guix, kontrolu la konstru-protokolon~%
pt_br: falha ao atualizar Guix; verifique o log de compilação~%
vi: gặp lỗi khi cập nhật Guix, hãy kiểm tra nhật ký xây dựng~%

source: Guix already up to date
eo: Guix jam estas ĝisdata
pt_br: Guix já está atualizado
vi: Guix đã cập nhật rồi

source: while fetching ~a: server is unresponsive~%
eo: dum havigo de ~a: servilo ne respondas~%
pt_br: enquanto obtinha ~a: servidor não está respondendo~%
vi: khi đang lấy ~a: máy chủ không trả lời~%

source: try `--no-substitutes' if the problem persists~%
eo: provu '--no-substituse' se la problemo persistos~%
pt_br: Tente "--no-substitutes" se o problema persistir~%
vi: dùng `--no-substitutes' nếu vấn đề vẫn không được giải quyết~%

source: Downloading, please wait...~%
eo: Ni elŝutas, bonvolu atendi...~%
pt_br: Baixando, por favor aguarde...~%
vi: Đang tải, vui lòng chờ...~%

source: (Please consider upgrading Guile to get proper progress report.)~%
eo: (Bonvolu konsideri pri ĝisdatigo de Guile por havigi ĝustan progres-raporton.)~%
pt_br: (Por favor, considere atualizar o Guile para obter o relatório adequado do progresso.)~%
vi: (Hãy cân nhắc nâng cấp Guile để nhận được báo cáo tiến trình đúng đắn.)~%

source: host name lookup error: ~a~%
eo: eraro en serĉado de gastigant-nomo: ~a~%
pt_br: erro na busca pelo nome da máquina: ~a~%
vi: lỗi truy vấn tên máy: ~a~%

source: Usage: guix substitute-binary [OPTION]... Internal tool to substitute a pre-built binary to a local build.
eo: Uzmaniero: guix substitute-binary [MODIFILO]... Interna ilo por anstataŭigi antaŭ-konstruitan duumaĵon al loka kompilaĵo.
pt_br: Uso: guix substitute-binary [OPÇÃO]... Ferramenta interna para substituir um binário pré-compilado para uma compilação local.
vi: Cách dùng: guix substitute-binary [TÙY-CHỌN]... Công cụ nội tại để thay thế nhị phân dịch sẵn thành dịch nội bộ.

source: --query report on the availability of substitutes for the store file names passed on the standard input
eo: --query raporti pri la disponebleco de anstataŭigoj por la konservaj dosier-nomoj indikitaj per la ĉefenigujo
pt_br: --query relata a disponibilidade de substitutos para os nomes de arquivos de armazenamento passados na entrada padrão
vi: --query báo cáo trên tính sẵn sàng của thay thế cho các tên tập-tin lưu trữ được chuyển trên đầu ra tiêu chuẩn

source: --substitute STORE-FILE DESTINATION download STORE-FILE and store it as a Nar in file DESTINATION
eo: --substitute KONSERV-DOSIERO CELO elŝuti KONSERV-DOSIEROn kaj konservi ĝin kiel Nar en la dosiero CELO
pt_br: --substitute ARQUIVO-ARMAZENAMENTO DESTINO baixa ARQUIVO-ARMAZENAMENTO e armazena-o como um Nar no arquivo DESTINO
vi: --substitute TẬP-TIN-LƯU ĐÍCH tải về TẬP-TIN-LƯU và lưu nó trong tập tin ĐÍCH Nar

source: ~a: unrecognized options~%
eo: ~a: nerekonata modifiloj~%
pt_br: ~a: opções desconhecidas~%
vi: ~a: không chấp nhận các tùy chọn~%

source: signature verification failed for `~a'~%
eo: subskriba kontrolo fiaskis por '~a'~%
pt_br: Falha na verificação de assinatura de "~a"~%
vi: việc xác minh chữ ký cho `~a'~% gặp lỗi

source: (could be because the public key is not in your keyring)~%
eo: (eble ĉar la publika ŝlosilo ne estas en via ŝlosilringo)~%
pt_br: (poderia ser porque a chave pública não está no seu chaveiro)~%
vi: (có thể nguyên nhân là do khóa công không có trong chùm chìa khóa của bạn)~%

source: ~a: could not locate source file
eo: ~a: ne eblis trovi fontan dosieron
pt_br: ~a: não foi possível localizar um arquivo fonte
vi: ~a: không thể xác định tập tin nguồn

source: ~a: ~a: no `version' field in source; skipping~%
eo: ~a: ~a: neniu kampo 'version' en la fonto; ni saltas~%
pt_br: ~a: ~a: sem o campo "version" no fonte; pulando~%
vi: ~a: ~a: không có trường `version' trong nguồn; bỏ qua~%

source: failed to install locale: ~a~%
eo: fiasko dum instalo de lokaĵaro: ~a~%
pt_br: falha ao instalar local: ~a~%
vi: gặp lỗi khi cài đặt `locale': ~a~%

source: Copyright (C) 2013 the Guix authors License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
vi: Bản quyền (C) 2013 thuộc về các tác giả Guix. Giấy phép GPL pb3+: Giấy phép Công cộng GNU phiên bản 3 hay sau <http://gnu.org/licenses/gpl.html> Đây là phần mềm tự do: bạn có quyền sửa đổi và phát hành lại nó.KHÔNG CÓ BẢO HÀNH GÌ CẢ, với điều kiện được pháp luật cho phép.

source: Report bugs to: ~a.
eo: Raportu program-misojn al: ~a.
pt_br: Relate erros para: ~a.
vi: Hãy thông báo lỗi cho ~a.

source: ~a home page: <~a>
eo: hejm-paĝo de ~a: <~a>
pt_br: Site do ~a: <~a>
vi: ~a trang chủ: <~a>

source: General help using GNU software: <http://www.gnu.org/gethelp/>
eo: Ĝenerala helpo por uzi programaron de GNU: <http://www.gnu.org/gethelp/>
pt_br: Ajuda em geral usando softwares GNU: <http://www.gnu.org/gethelp/>
vi: Trợ giúp chung về sử dụng phần mềm GNU: <http://www.gnu.org/gethelp/>

source: ~a: invalid number~%
eo: ~a: nevalida numero~%
pt_br: ~a: número inválido~%
vi: ~a: số không hợp lệ~%

source: ~a:~a:~a: package `~a' has an invalid input: ~s~%
eo: ~a:~a:~a: pako '~a' havas malvalidan enigon: ~s~%
pt_br: ~a:~a:~a: pacote "~a" tem uma entrada inválida: ~s~%
vi: ~a:~a:~a: gói `~a' có đầu vào không hợp lệ: ~s~%

source: ~a: ~a: build system `~a' does not support cross builds~%
eo: ~a: ~a: konstrui sistemon '~a' ne subtenas crucajn konstruojn~%
pt_br: ~a: ~a: sistema de compilação de "~a" não tem suporte a compilações cruzadas~%
vi: ~a: ~a: hệ thống dịch `~a' không hỗ trợ dịch chéo~%

source: failed to connect to `~a': ~a~%
eo: fiasko dum konekto al '~a': ~a~%
pt_br: falha ao conectar em "~a": ~a~%
vi: gặp lỗi khi kết nối đến `~a': ~a~%

source: build failed: ~a~%
eo: konstruo fiakis: ~a~%
pt_br: compilação falhou: ~a~%
vi: xây dựng gặp lỗi: ~a~%

source: failed to read expression ~s: ~s~%
eo: fiasko dum lego de esprimo ~s: ~s~%
pt_br: falha ao ler a expressão ~s: ~s~%
vi: gặp lỗi khi đọc biểu thức ~s: ~s~%

source: failed to evaluate expression `~a': ~s~%
eo: fiasko dum analizo de esprimo '~a': ~a~%
pt_br: falha ao avaliar a expressão "~a": ~s~%
vi: gặp lỗi khi định giá biểu thức `~a': ~s~%

source: expression ~s does not evaluate to a package~%
eo: la esprimo ~s ne rezultas pakon~%
vi: biểu thức `~s' không được định giá cho gói~%

source: ~:[The following derivation would be built:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo povus esti konstruata:~%~{ ~a~%~}~;~]
pt_br: ~:[A seguinte derivação será compilada:~%~{ ~a~%~}~;~]
vi: ~:[Nguồn sau đây sẽ được xây dựng:~%~{ ~a~%~}~;~]

source: ~:[The following file would be downloaded:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo povus esti elŝutata:~%~{ ~a~%~}~;~]
pt_br: ~:[O seguinte arquivo será baixado:~%~{ ~a~%~}~;~]
vi: ~:[Tập tin sau đây sẽ được tải về:~%~{ ~a~%~}~;~]

source: ~:[The following derivation will be built:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo estos esti konstruata:~%~{ ~a~%~}~;~]
pt_br: ~:[A seguinte derivação será compilada:~%~{ ~a~%~}~;~]
vi: ~:[Nguồn sau đây sẽ được biên dịch:~%~{ ~a~%~}~;~]

source: ~:[The following file will be downloaded:~%~{ ~a~%~}~;~]
eo: ~:[La jena derivo estos esti elŝutata:~%~{ ~a~%~}~;~]
pt_br: ~:[O seguinte arquivo será baixado:~%~{ ~a~%~}~;~]
vi: ~:[Những tập tin sau đây sẽ được tải về:~%~{ ~a~%~}~;~]

source: <unknown location>
eo: <nekonata loko>
pt_br: <local desconhecido>
vi: <không hiểu vị trí>

source: failed to create configuration directory `~a': ~a~%
eo: fiasko dum kreo de agorda dosierujo '~a': ~a~%
pt_br: falha ao criar o diretório de compilação "~a": ~a~%
vi: gặp lỗi khi tạo thư mục cấu hình `~a': ~a~%

source: unknown
eo: nekonata
pt_br: desconhecido
vi: không hiểu

source: invalid argument: ~a~%
eo: malvalida argumento: ~a~%
pt_br: argumento inválido: ~a~%
vi: đối số không hợp lệ: ~a~%

source: Try `guix --help' for more information.~%
eo: Provu 'guix --help' por pli da informo.~%
pt_br: Tente "guix --help" para mais informações.~%
vi: Chạy lệnh `guix --help' để biết thêm thông tin.~%

source: Usage: guix COMMAND ARGS... Run COMMAND with ARGS.
eo: Uzmaniero: guix KOMANDO ARGj... Lanĉas KOMANDOn kun ARGj.
pt_br: Uso: guix COMANDO ARGUMENTOS... Executa COMANDO com ARGUMENTOS.
vi: Cách dùng: guix LỆNH ĐỐI_SỐ... Chạy LỆNH với các ĐỐI SỐ.

source: COMMAND must be one of the sub-commands listed below:
eo: KOMANDO devas esti unu el la sub-komandoj sube listataj:
pt_br: COMANDO deve ser um dos subcomandos listados abaixo:
vi: LỆNH phải là một trong số những câu lệnh con được liệt kê dưới đây:

source: guix: ~a: command not found~%
eo: guix: ~a: komando ne trovita~%
pt_br: guix: ~a: comando não encontrado~%
vi: guix: ~a: không tìm thấy lệnh~%

source: guix: missing command name~%
eo: guix: mankas komanda nomo~%
pt_br: guix: faltando um nome de comando~%
vi: guix: thiếu tên lệnh~%

source: guix: unrecognized option '~a'~%
eo: guix: nerekonata modifilo: '~a'~%
pt_br: guix: opção "~a" desconhecida~%
vi: guix: tùy chọn không được thừa nhận `~a'~%

source: using Guile ~a, which does not support ~s encoding~%
eo: ni uzas Guile ~a, kiu ne subtenas enkodigon ~s~%
pt_br: usando Guile ~a, o qual não oferece suporte codificação ~s~%
vi: đang dùng Guile ~a, mà nó lại không hỗ trợ ~s bộ mã~%

source: download failed; use a newer Guile~%
eo: elŝuto fiaskis; uzu pli novan Guile~%
pt_br: download falhou; use um Guile mais novo~%
vi: tải về gặp lỗi; dùng Guile mới hơn~%

source: following redirection to `~a'...~%
eo: ni sekvas la redirektigon al '~a'...~%
pt_br: seguindo redirecionamento para "~a"...~%
vi: đang cho chuyển hướng sang `~a'...~%

source: GNU Hello prints the message "Hello, world!" and then exits. It serves as an example of standard GNU coding practices. As such, it supports command-line arguments, multiple languages, and so on.
eo: GNU Hello montras la mesaĝon "Hello, world!" kaj finiĝas. Ĝi funkcias kiel ekzemplo de norma kodumada tradicio de GNU. Tiel, ĝi subtenas komand-liniajn argumentojn, plurajn lingvojn, kaj tiel plu.

source: Lout, a document layout system similar in style to LaTeX
eo: Lout, dokument-aranĝa sistemo simila al LaTeX, laŭ stilo
pt_br: Lout, um sistema de layout de documentos similar em estilo ao LaTeX

source: Any Unix-like operating system needs a C library: the library which defines the "system calls" and other basic facilities such as open, malloc, printf, exit... The GNU C library is used as the C library in the GNU system and most systems with the Linux kernel.
pt_br: Qualquer sistema operacional tipo Unix precisa de uma biblioteca C: a biblioteca que define as "chamadas de sistema" e outras funcionalidades básicas como open, malloc, printf, exit ... A biblioteca C do GNU é usada como uma biblioteca C no sistema GNU e na maioria dos sistemas com kernel Linux.

source: The Time Zone Database (often called tz or zoneinfo) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules.
pt_br: O Time Zone Database (geralmente chamado de tz ou zoneinfo) contém códigos e dados que representam o histórico dos horários locais de muitas localizações representativas pelo mundo. É atualizado periodicamente para refletir as alterações feitas por corpos políticos nos limites de fusos horários, posição do UTC e regras de horário de verão.

source: The linker wrapper (or `ld-wrapper') wraps the linker to add any missing `-rpath' flags, and to detect any misuse of libraries outside of the store.
pt_br: o linker wrapper (ou `ld-wrapper') atua como interface do linker para adicionar quaisquer opções "-rpath" faltando e para detectar qualquer uso incorreto de bibliotecas fora do armazenamento.

source: Guile-Reader is a simple framework for building readers for GNU Guile. The idea is to make it easy to build procedures that extend Guile’s read procedure. Readers supporting various syntax variants can easily be written, possibly by re-using existing “token readers” of a standard Scheme readers. For example, it is used to implement Skribilo’s R5RS-derived document syntax. Guile-Reader’s approach is similar to Common Lisp’s “read table”, but hopefully more powerful and flexible (for instance, one may instantiate as many readers as needed).
pt_br: Guile-Reader é uma infraestrutura simples de compilação de leitores GNU Guile. A ideia é facilitar a compilação de procedimentos que estendam o procedimento de leitura do Guile. Leitores que tenham suporte a diversas variantes de sintaxe podem ser escritos facilmente, possivelmente reusando "leitores de token" de Scheme padrão de leitores. Por exemplo, ele é usado para implementar sintaxe de documentos derivados do R5RS do Skribilo. A abordagem do Guile-Readers é similar ao "read table" do Common Lisps, mas muito mais poderoso e flexível (por exemplo, é possível instanciar com quantos leitores quiser).

source: guile-lib is intended as an accumulation place for pure-scheme Guile modules, allowing for people to cooperate integrating their generic Guile modules into a coherent library. Think "a down-scaled, limited-scope CPAN for Guile".
pt_br: guile-lib tem a intenção de ser um lugar acumulado para módulos Guile de pure-scheme, permitindo que pessoas cooperem com integração de seus módulos genéricos de Guile em uma biblioteca coerente. Pense "um CPAN de escopo limitado, objetivo para Guile".

source: The Lout document formatting system is now reads a high-level description of a document similar in style to LaTeX and produces a PostScript or plain text output file. Lout offers an unprecedented range of advanced features, including optimal paragraph and page breaking, automatic hyphenation, PostScript EPS file inclusion and generation, equation formatting, tables, diagrams, rotation and scaling, sorted indexes, bibliographic databases, running headers and odd-even pages, automatic cross referencing, multilingual documents including hyphenation (most European languages are supported), formatting of computer programs, and much more, all ready to use. Furthermore, Lout is easily extended with definitions which are very much easier to write than troff of TeX macros because Lout is a high-level, purely functional language, the outcome of an eight-year research project that went back to the beginning.
pt_br: O sistema de formatação de texto Lout agora lê uma descrição de alto nível de documentos similar em estilo ao LaTeX e produz um arquivo de saída em texto simples ou em PostScript. Lout oferece uma faixa sem precedente de recursos avançados, incluindo uma ótima quebra de parágrafo e página, hifenização automática, inclusão e criação de arquivo EPS de PostScript, formatação de equação, tabelas, diagramas, rotação e escalas, índices ordenados, banco de dados bibliográficos, executar cabeçalhos e páginas ímpar-par, referência cruzada automática, documentos multilíngues incluindo hifenização (há suporte à maioria dos idiomas europeus), formatação de programas de computador, e muito mais, tudo pronto para uso. Além disso, Lout pode ser estendido facilmente com definições que são muito fácil de escrever do que troff das macros TeX porque Lout é uma linguagem puramente funcional de alto nível, sendo o resultado de oito anos de um projeto de pesquisa que voltou para o começo.
